morser499/mbed-os/targets/TARGET_WICED_SRC/WICED/WICED/platform/MCU/TARGET_STM32F4/peripherals/libraries/w_stm32f4xx.h
/*******************  Bit definition for DSI_TCCR3 register  **************/
#define DSI_TCCR3_HSWR_TOCNT           ((uint32_t)0x0000FFFF)               /*!< High-Speed Write Timeout Counter */
#define DSI_TCCR3_HSWR_TOCNT0          ((uint32_t)0x00000001)
#define DSI_TCCR3_HSWR_TOCNT1          ((uint32_t)0x00000002)
#define DSI_TCCR3_HSWR_TOCNT2          ((uint32_t)0x00000004)
#define DSI_TCCR3_HSWR_TOCNT3          ((uint32_t)0x00000008)
#define DSI_TCCR3_HSWR_TOCNT4          ((uint32_t)0x00000010)
#define DSI_TCCR3_HSWR_TOCNT5          ((uint32_t)0x00000020)
#define DSI_TCCR3_HSWR_TOCNT6          ((uint32_t)0x00000040)
#define DSI_TCCR3_HSWR_TOCNT7          ((uint32_t)0x00000080)
#define DSI_TCCR3_HSWR_TOCNT8          ((uint32_t)0x00000100)
#define DSI_TCCR3_HSWR_TOCNT9          ((uint32_t)0x00000200)
#define DSI_TCCR3_HSWR_TOCNT10         ((uint32_t)0x00000400)
#define DSI_TCCR3_HSWR_TOCNT11         ((uint32_t)0x00000800)
#define DSI_TCCR3_HSWR_TOCNT12         ((uint32_t)0x00001000)
#define DSI_TCCR3_HSWR_TOCNT13         ((uint32_t)0x00002000)
#define DSI_TCCR3_HSWR_TOCNT14         ((uint32_t)0x00004000)
#define DSI_TCCR3_HSWR_TOCNT15         ((uint32_t)0x00008000)

#define DSI_TCCR3_PM                   ((uint32_t)0x01000000)               /*!< Presp Mode */

/*******************  Bit definition for DSI_TCCR4 register  **************/
#define DSI_TCCR4_LPWR_TOCNT           ((uint32_t)0x0000FFFF)               /*!< Low-Power Write Timeout Counter */
#define DSI_TCCR4_LPWR_TOCNT0          ((uint32_t)0x00000001)
#define DSI_TCCR4_LPWR_TOCNT1          ((uint32_t)0x00000002)
#define DSI_TCCR4_LPWR_TOCNT2          ((uint32_t)0x00000004)
#define DSI_TCCR4_LPWR_TOCNT3          ((uint32_t)0x00000008)
#define DSI_TCCR4_LPWR_TOCNT4          ((uint32_t)0x00000010)
#define DSI_TCCR4_LPWR_TOCNT5          ((uint32_t)0x00000020)
#define DSI_TCCR4_LPWR_TOCNT6          ((uint32_t)0x00000040)
#define DSI_TCCR4_LPWR_TOCNT7          ((uint32_t)0x00000080)
#define DSI_TCCR4_LPWR_TOCNT8          ((uint32_t)0x00000100)
#define DSI_TCCR4_LPWR_TOCNT9          ((uint32_t)0x00000200)
#define DSI_TCCR4_LPWR_TOCNT10         ((uint32_t)0x00000400)
#define DSI_TCCR4_LPWR_TOCNT11         ((uint32_t)0x00000800)
#define DSI_TCCR4_LPWR_TOCNT12         ((uint32_t)0x00001000)
#define DSI_TCCR4_LPWR_TOCNT13         ((uint32_t)0x00002000)
#define DSI_TCCR4_LPWR_TOCNT14         ((uint32_t)0x00004000)
#define DSI_TCCR4_LPWR_TOCNT15         ((uint32_t)0x00008000)

/*******************  Bit definition for DSI_TCCR5 register  **************/
#define DSI_TCCR5_BTA_TOCNT            ((uint32_t)0x0000FFFF)               /*!< Bus-Turn-Around Timeout Counter */
#define DSI_TCCR5_BTA_TOCNT0           ((uint32_t)0x00000001)
#define DSI_TCCR5_BTA_TOCNT1           ((uint32_t)0x00000002)
#define DSI_TCCR5_BTA_TOCNT2           ((uint32_t)0x00000004)
#define DSI_TCCR5_BTA_TOCNT3           ((uint32_t)0x00000008)
#define DSI_TCCR5_BTA_TOCNT4           ((uint32_t)0x00000010)
#define DSI_TCCR5_BTA_TOCNT5           ((uint32_t)0x00000020)
#define DSI_TCCR5_BTA_TOCNT6           ((uint32_t)0x00000040)
#define DSI_TCCR5_BTA_TOCNT7           ((uint32_t)0x00000080)
#define DSI_TCCR5_BTA_TOCNT8           ((uint32_t)0x00000100)
#define DSI_TCCR5_BTA_TOCNT9           ((uint32_t)0x00000200)
#define DSI_TCCR5_BTA_TOCNT10          ((uint32_t)0x00000400)
#define DSI_TCCR5_BTA_TOCNT11          ((uint32_t)0x00000800)
#define DSI_TCCR5_BTA_TOCNT12          ((uint32_t)0x00001000)
#define DSI_TCCR5_BTA_TOCNT13          ((uint32_t)0x00002000)
#define DSI_TCCR5_BTA_TOCNT14          ((uint32_t)0x00004000)
#define DSI_TCCR5_BTA_TOCNT15          ((uint32_t)0x00008000)

/*******************  Bit definition for DSI_TDCR register  ***************/
#define DSI_TDCR_3DM                   ((uint32_t)0x00000003)               /*!< 3D Mode */
#define DSI_TDCR_3DM0                  ((uint32_t)0x00000001)
#define DSI_TDCR_3DM1                  ((uint32_t)0x00000002)

#define DSI_TDCR_3DF                   ((uint32_t)0x0000000C)               /*!< 3D Format */
#define DSI_TDCR_3DF0                  ((uint32_t)0x00000004)
#define DSI_TDCR_3DF1                  ((uint32_t)0x00000008)

#define DSI_TDCR_SVS                   ((uint32_t)0x00000010)               /*!< Second VSYNC */
#define DSI_TDCR_RF                    ((uint32_t)0x00000020)               /*!< Right First */
#define DSI_TDCR_S3DC                  ((uint32_t)0x00010000)               /*!< Send 3D Control */

/*******************  Bit definition for DSI_CLCR register  ***************/
#define DSI_CLCR_DPCC                  ((uint32_t)0x00000001)               /*!< D-PHY Clock Control */
#define DSI_CLCR_ACR                   ((uint32_t)0x00000002)               /*!< Automatic Clocklane Control */

/*******************  Bit definition for DSI_CLTCR register  **************/
#define DSI_CLTCR_LP2HS_TIME           ((uint32_t)0x000003FF)               /*!< Low-Power to High-Speed Time */
#define DSI_CLTCR_LP2HS_TIME0          ((uint32_t)0x00000001)
#define DSI_CLTCR_LP2HS_TIME1          ((uint32_t)0x00000002)
#define DSI_CLTCR_LP2HS_TIME2          ((uint32_t)0x00000004)
#define DSI_CLTCR_LP2HS_TIME3          ((uint32_t)0x00000008)
#define DSI_CLTCR_LP2HS_TIME4          ((uint32_t)0x00000010)
#define DSI_CLTCR_LP2HS_TIME5          ((uint32_t)0x00000020)
#define DSI_CLTCR_LP2HS_TIME6          ((uint32_t)0x00000040)
#define DSI_CLTCR_LP2HS_TIME7          ((uint32_t)0x00000080)
#define DSI_CLTCR_LP2HS_TIME8          ((uint32_t)0x00000100)
#define DSI_CLTCR_LP2HS_TIME9          ((uint32_t)0x00000200)

#define DSI_CLTCR_HS2LP_TIME           ((uint32_t)0x03FF0000)               /*!< High-Speed to Low-Power Time */
#define DSI_CLTCR_HS2LP_TIME0          ((uint32_t)0x00010000)
#define DSI_CLTCR_HS2LP_TIME1          ((uint32_t)0x00020000)
#define DSI_CLTCR_HS2LP_TIME2          ((uint32_t)0x00040000)
#define DSI_CLTCR_HS2LP_TIME3          ((uint32_t)0x00080000)
#define DSI_CLTCR_HS2LP_TIME4          ((uint32_t)0x00100000)
#define DSI_CLTCR_HS2LP_TIME5          ((uint32_t)0x00200000)
#define DSI_CLTCR_HS2LP_TIME6          ((uint32_t)0x00400000)
#define DSI_CLTCR_HS2LP_TIME7          ((uint32_t)0x00800000)
#define DSI_CLTCR_HS2LP_TIME8          ((uint32_t)0x01000000)
#define DSI_CLTCR_HS2LP_TIME9          ((uint32_t)0x02000000)

/*******************  Bit definition for DSI_DLTCR register  **************/
#define DSI_DLTCR_MRD_TIME             ((uint32_t)0x00007FFF)               /*!< Maximum Read Time */
#define DSI_DLTCR_MRD_TIME0            ((uint32_t)0x00000001)
#define DSI_DLTCR_MRD_TIME1            ((uint32_t)0x00000002)
#define DSI_DLTCR_MRD_TIME2            ((uint32_t)0x00000004)
#define DSI_DLTCR_MRD_TIME3            ((uint32_t)0x00000008)
#define DSI_DLTCR_MRD_TIME4            ((uint32_t)0x00000010)
#define DSI_DLTCR_MRD_TIME5            ((uint32_t)0x00000020)
#define DSI_DLTCR_MRD_TIME6            ((uint32_t)0x00000040)
#define DSI_DLTCR_MRD_TIME7            ((uint32_t)0x00000080)
#define DSI_DLTCR_MRD_TIME8            ((uint32_t)0x00000100)
#define DSI_DLTCR_MRD_TIME9            ((uint32_t)0x00000200)
#define DSI_DLTCR_MRD_TIME10           ((uint32_t)0x00000400)
#define DSI_DLTCR_MRD_TIME11           ((uint32_t)0x00000800)
#define DSI_DLTCR_MRD_TIME12           ((uint32_t)0x00001000)
#define DSI_DLTCR_MRD_TIME13           ((uint32_t)0x00002000)
#define DSI_DLTCR_MRD_TIME14           ((uint32_t)0x00004000)

#define DSI_DLTCR_LP2HS_TIME           ((uint32_t)0x00FF0000)               /*!< Low-Power To High-Speed Time */
#define DSI_DLTCR_LP2HS_TIME0          ((uint32_t)0x00010000)
#define DSI_DLTCR_LP2HS_TIME1          ((uint32_t)0x00020000)
#define DSI_DLTCR_LP2HS_TIME2          ((uint32_t)0x00040000)
#define DSI_DLTCR_LP2HS_TIME3          ((uint32_t)0x00080000)
#define DSI_DLTCR_LP2HS_TIME4          ((uint32_t)0x00100000)
#define DSI_DLTCR_LP2HS_TIME5          ((uint32_t)0x00200000)
#define DSI_DLTCR_LP2HS_TIME6          ((uint32_t)0x00400000)
#define DSI_DLTCR_LP2HS_TIME7          ((uint32_t)0x00800000)

#define DSI_DLTCR_HS2LP_TIME           ((uint32_t)0xFF000000)               /*!< High-Speed To Low-Power Time */
#define DSI_DLTCR_HS2LP_TIME0          ((uint32_t)0x01000000)
#define DSI_DLTCR_HS2LP_TIME1          ((uint32_t)0x02000000)
#define DSI_DLTCR_HS2LP_TIME2          ((uint32_t)0x04000000)
#define DSI_DLTCR_HS2LP_TIME3          ((uint32_t)0x08000000)
#define DSI_DLTCR_HS2LP_TIME4          ((uint32_t)0x10000000)
#define DSI_DLTCR_HS2LP_TIME5          ((uint32_t)0x20000000)
#define DSI_DLTCR_HS2LP_TIME6          ((uint32_t)0x40000000)
#define DSI_DLTCR_HS2LP_TIME7          ((uint32_t)0x80000000)

