morser499/mbed-os/targets/TARGET_WICED_SRC/WICED/WICED/platform/MCU/TARGET_STM32F4/peripherals/libraries/w_stm32f4xx.h
/*******************  Bit definition for DSI_VLCCR register  **************/
#define DSI_VLCCR_HLINE                ((uint32_t)0x00007FFF)               /*!< Horizontal Line duration */
#define DSI_VLCCR_HLINE0               ((uint32_t)0x00000001)
#define DSI_VLCCR_HLINE1               ((uint32_t)0x00000002)
#define DSI_VLCCR_HLINE2               ((uint32_t)0x00000004)
#define DSI_VLCCR_HLINE3               ((uint32_t)0x00000008)
#define DSI_VLCCR_HLINE4               ((uint32_t)0x00000010)
#define DSI_VLCCR_HLINE5               ((uint32_t)0x00000020)
#define DSI_VLCCR_HLINE6               ((uint32_t)0x00000040)
#define DSI_VLCCR_HLINE7               ((uint32_t)0x00000080)
#define DSI_VLCCR_HLINE8               ((uint32_t)0x00000100)
#define DSI_VLCCR_HLINE9               ((uint32_t)0x00000200)
#define DSI_VLCCR_HLINE10              ((uint32_t)0x00000400)
#define DSI_VLCCR_HLINE11              ((uint32_t)0x00000800)
#define DSI_VLCCR_HLINE12              ((uint32_t)0x00001000)
#define DSI_VLCCR_HLINE13              ((uint32_t)0x00002000)
#define DSI_VLCCR_HLINE14              ((uint32_t)0x00004000)

/*******************  Bit definition for DSI_VVSACCR register  ***************/
#define DSI_VVSACCR_VSA                   ((uint32_t)0x000003FF)               /*!< Vertical Synchronism Active duration */
#define DSI_VVSACCR_VSA0                  ((uint32_t)0x00000001)
#define DSI_VVSACCR_VSA1                  ((uint32_t)0x00000002)
#define DSI_VVSACCR_VSA2                  ((uint32_t)0x00000004)
#define DSI_VVSACCR_VSA3                  ((uint32_t)0x00000008)
#define DSI_VVSACCR_VSA4                  ((uint32_t)0x00000010)
#define DSI_VVSACCR_VSA5                  ((uint32_t)0x00000020)
#define DSI_VVSACCR_VSA6                  ((uint32_t)0x00000040)
#define DSI_VVSACCR_VSA7                  ((uint32_t)0x00000080)
#define DSI_VVSACCR_VSA8                  ((uint32_t)0x00000100)
#define DSI_VVSACCR_VSA9                  ((uint32_t)0x00000200)

/*******************  Bit definition for DSI_VVBPCCR register  ************/
#define DSI_VVBPCCR_VBP                ((uint32_t)0x000003FF)               /*!< Vertical Back-Porch duration */
#define DSI_VVBPCCR_VBP0               ((uint32_t)0x00000001)
#define DSI_VVBPCCR_VBP1               ((uint32_t)0x00000002)
#define DSI_VVBPCCR_VBP2               ((uint32_t)0x00000004)
#define DSI_VVBPCCR_VBP3               ((uint32_t)0x00000008)
#define DSI_VVBPCCR_VBP4               ((uint32_t)0x00000010)
#define DSI_VVBPCCR_VBP5               ((uint32_t)0x00000020)
#define DSI_VVBPCCR_VBP6               ((uint32_t)0x00000040)
#define DSI_VVBPCCR_VBP7               ((uint32_t)0x00000080)
#define DSI_VVBPCCR_VBP8               ((uint32_t)0x00000100)
#define DSI_VVBPCCR_VBP9               ((uint32_t)0x00000200)

/*******************  Bit definition for DSI_VVFPCCR register  ************/
#define DSI_VVFPCCR_VFP                ((uint32_t)0x000003FF)               /*!< Vertical Front-Porch duration */
#define DSI_VVFPCCR_VFP0               ((uint32_t)0x00000001)
#define DSI_VVFPCCR_VFP1               ((uint32_t)0x00000002)
#define DSI_VVFPCCR_VFP2               ((uint32_t)0x00000004)
#define DSI_VVFPCCR_VFP3               ((uint32_t)0x00000008)
#define DSI_VVFPCCR_VFP4               ((uint32_t)0x00000010)
#define DSI_VVFPCCR_VFP5               ((uint32_t)0x00000020)
#define DSI_VVFPCCR_VFP6               ((uint32_t)0x00000040)
#define DSI_VVFPCCR_VFP7               ((uint32_t)0x00000080)
#define DSI_VVFPCCR_VFP8               ((uint32_t)0x00000100)
#define DSI_VVFPCCR_VFP9               ((uint32_t)0x00000200)

/*******************  Bit definition for DSI_VVACCR register  *************/
#define DSI_VVACCR_VA                  ((uint32_t)0x00003FFF)               /*!< Vertical Active duration */
#define DSI_VVACCR_VA0                 ((uint32_t)0x00000001)
#define DSI_VVACCR_VA1                 ((uint32_t)0x00000002)
#define DSI_VVACCR_VA2                 ((uint32_t)0x00000004)
#define DSI_VVACCR_VA3                 ((uint32_t)0x00000008)
#define DSI_VVACCR_VA4                 ((uint32_t)0x00000010)
#define DSI_VVACCR_VA5                 ((uint32_t)0x00000020)
#define DSI_VVACCR_VA6                 ((uint32_t)0x00000040)
#define DSI_VVACCR_VA7                 ((uint32_t)0x00000080)
#define DSI_VVACCR_VA8                 ((uint32_t)0x00000100)
#define DSI_VVACCR_VA9                 ((uint32_t)0x00000200)
#define DSI_VVACCR_VA10                ((uint32_t)0x00000400)
#define DSI_VVACCR_VA11                ((uint32_t)0x00000800)
#define DSI_VVACCR_VA12                ((uint32_t)0x00001000)
#define DSI_VVACCR_VA13                ((uint32_t)0x00002000)

/*******************  Bit definition for DSI_TDCCR register  **************/
#define DSI_TDCCR_3DM                  ((uint32_t)0x00000003)               /*!< 3D Mode */
#define DSI_TDCCR_3DM0                 ((uint32_t)0x00000001)
#define DSI_TDCCR_3DM1                 ((uint32_t)0x00000002)

#define DSI_TDCCR_3DF                  ((uint32_t)0x0000000C)               /*!< 3D Format */
#define DSI_TDCCR_3DF0                 ((uint32_t)0x00000004)
#define DSI_TDCCR_3DF1                 ((uint32_t)0x00000008)

#define DSI_TDCCR_SVS                  ((uint32_t)0x00000010)               /*!< Second VSYNC */
#define DSI_TDCCR_RF                   ((uint32_t)0x00000020)               /*!< Right First */
#define DSI_TDCCR_S3DC                 ((uint32_t)0x00010000)               /*!< Send 3D Control */

/*******************  Bit definition for DSI_WCFGR register  ***************/
#define DSI_WCFGR_DSIM                   ((uint32_t)0x00000001)              /*!< DSI Mode */
#define DSI_WCFGR_COLMUX                 ((uint32_t)0x0000000E)              /*!< Color Multiplexing */
#define DSI_WCFGR_COLMUX0                ((uint32_t)0x00000002)
#define DSI_WCFGR_COLMUX1                ((uint32_t)0x00000004)
#define DSI_WCFGR_COLMUX2                ((uint32_t)0x00000008)
 
#define DSI_WCFGR_TESRC                  ((uint32_t)0x00000010)              /*!< Tearing Effect Source */
#define DSI_WCFGR_TEPOL                  ((uint32_t)0x00000020)              /*!< Tearing Effect Polarity */
#define DSI_WCFGR_AR                     ((uint32_t)0x00000040)              /*!< Automatic Refresh */
#define DSI_WCFGR_VSPOL                  ((uint32_t)0x00000080)              /*!< VSync Polarity */

/*******************  Bit definition for DSI_WCR register  *****************/
#define DSI_WCR_COLM                     ((uint32_t)0x00000001)              /*!< Color Mode */
#define DSI_WCR_SHTDN                    ((uint32_t)0x00000002)              /*!< Shutdown */
#define DSI_WCR_LTDCEN                   ((uint32_t)0x00000004)              /*!< LTDC Enable */
#define DSI_WCR_DSIEN                    ((uint32_t)0x00000008)              /*!< DSI Enable */

/*******************  Bit definition for DSI_WIER register  ****************/
#define DSI_WIER_TEIE                    ((uint32_t)0x00000001)              /*!< Tearing Effect Interrupt Enable */
#define DSI_WIER_ERIE                    ((uint32_t)0x00000002)              /*!< End of Refresh Interrupt Enable */
#define DSI_WIER_PLLLIE                  ((uint32_t)0x00000200)              /*!< PLL Lock Interrupt Enable */
#define DSI_WIER_PLLUIE                  ((uint32_t)0x00000400)              /*!< PLL Unlock Interrupt Enable */
#define DSI_WIER_RRIE                    ((uint32_t)0x00002000)              /*!< Regulator Ready Interrupt Enable */

/*******************  Bit definition for DSI_WISR register  ****************/
#define DSI_WISR_TEIF                    ((uint32_t)0x00000001)              /*!< Tearing Effect Interrupt Flag */
#define DSI_WISR_ERIF                    ((uint32_t)0x00000002)              /*!< End of Refresh Interrupt Flag */
#define DSI_WISR_BUSY                    ((uint32_t)0x00000004)              /*!< Busy Flag */
#define DSI_WISR_PLLLS                   ((uint32_t)0x00000100)              /*!< PLL Lock Status */
#define DSI_WISR_PLLLIF                  ((uint32_t)0x00000200)              /*!< PLL Lock Interrupt Flag */
#define DSI_WISR_PLLUIF                  ((uint32_t)0x00000400)              /*!< PLL Unlock Interrupt Flag */
#define DSI_WISR_RRS                     ((uint32_t)0x00001000)              /*!< Regulator Ready Flag */
#define DSI_WISR_RRIF                    ((uint32_t)0x00002000)              /*!< Regulator Ready Interrupt Flag */

/*******************  Bit definition for DSI_WIFCR register  ***************/
#define DSI_WIFCR_CTEIF                  ((uint32_t)0x00000001)              /*!< Clear Tearing Effect Interrupt Flag */
#define DSI_WIFCR_CERIF                  ((uint32_t)0x00000002)              /*!< Clear End of Refresh Interrupt Flag */
#define DSI_WIFCR_CPLLLIF                ((uint32_t)0x00000200)              /*!< Clear PLL Lock Interrupt Flag */
#define DSI_WIFCR_CPLLUIF                ((uint32_t)0x00000400)              /*!< Clear PLL Unlock Interrupt Flag */
#define DSI_WIFCR_CRRIF                  ((uint32_t)0x00002000)              /*!< Clear Regulator Ready Interrupt Flag */

