morser499/mbed-os/targets/TARGET_WICED_SRC/WICED/WICED/platform/MCU/TARGET_STM32F4/peripherals/libraries/w_stm32f4xx.h
/*******************  Bit definition for DSI_WPCR0 register  ***************/
#define DSI_WPCR0_UIX4                   ((uint32_t)0x0000003F)              /*!< Unit Interval multiplied by 4 */
#define DSI_WPCR0_UIX4_0                 ((uint32_t)0x00000001)
#define DSI_WPCR0_UIX4_1                 ((uint32_t)0x00000002)
#define DSI_WPCR0_UIX4_2                 ((uint32_t)0x00000004)
#define DSI_WPCR0_UIX4_3                 ((uint32_t)0x00000008)
#define DSI_WPCR0_UIX4_4                 ((uint32_t)0x00000010)
#define DSI_WPCR0_UIX4_5                 ((uint32_t)0x00000020)

#define DSI_WPCR0_SWCL                   ((uint32_t)0x00000040)              /*!< Swap pins on clock lane */
#define DSI_WPCR0_SWDL0                  ((uint32_t)0x00000080)              /*!< Swap pins on data lane 1 */
#define DSI_WPCR0_SWDL1                  ((uint32_t)0x00000100)              /*!< Swap pins on data lane 2 */
#define DSI_WPCR0_HSICL                  ((uint32_t)0x00000200)              /*!< Invert the high-speed data signal on clock lane */
#define DSI_WPCR0_HSIDL0                 ((uint32_t)0x00000400)              /*!< Invert the high-speed data signal on lane 1 */
#define DSI_WPCR0_HSIDL1                 ((uint32_t)0x00000800)              /*!< Invert the high-speed data signal on lane 2 */
#define DSI_WPCR0_FTXSMCL                ((uint32_t)0x00001000)              /*!< Force clock lane in TX stop mode */
#define DSI_WPCR0_FTXSMDL                ((uint32_t)0x00002000)              /*!< Force data lanes in TX stop mode */
#define DSI_WPCR0_CDOFFDL                ((uint32_t)0x00004000)              /*!< Contention detection OFF */
#define DSI_WPCR0_TDDL                   ((uint32_t)0x00010000)              /*!< Turn Disable Data Lanes */
#define DSI_WPCR0_PDEN                   ((uint32_t)0x00040000)              /*!< Pull-Down Enable */
#define DSI_WPCR0_TCLKPREPEN             ((uint32_t)0x00080000)              /*!< Timer for t-CLKPREP Enable */
#define DSI_WPCR0_TCLKZEROEN             ((uint32_t)0x00100000)              /*!< Timer for t-CLKZERO Enable */
#define DSI_WPCR0_THSPREPEN              ((uint32_t)0x00200000)              /*!< Timer for t-HSPREP Enable */
#define DSI_WPCR0_THSTRAILEN             ((uint32_t)0x00400000)              /*!< Timer for t-HSTRAIL Enable */
#define DSI_WPCR0_THSZEROEN              ((uint32_t)0x00800000)              /*!< Timer for t-HSZERO Enable */
#define DSI_WPCR0_TLPXDEN                ((uint32_t)0x01000000)              /*!< Timer for t-LPXD Enable */
#define DSI_WPCR0_THSEXITEN              ((uint32_t)0x02000000)              /*!< Timer for t-HSEXIT Enable */
#define DSI_WPCR0_TLPXCEN                ((uint32_t)0x04000000)              /*!< Timer for t-LPXC Enable */
#define DSI_WPCR0_TCLKPOSTEN             ((uint32_t)0x08000000)              /*!< Timer for t-CLKPOST Enable */

/*******************  Bit definition for DSI_WPCR1 register  ***************/
#define DSI_WPCR1_HSTXDCL                ((uint32_t)0x00000003)              /*!< High-Speed Transmission Delay on Clock Lane */
#define DSI_WPCR1_HSTXDCL0               ((uint32_t)0x00000001)
#define DSI_WPCR1_HSTXDCL1               ((uint32_t)0x00000002)

#define DSI_WPCR1_HSTXDDL                ((uint32_t)0x0000000C)              /*!< High-Speed Transmission Delay on Data Lane */
#define DSI_WPCR1_HSTXDDL0               ((uint32_t)0x00000004)
#define DSI_WPCR1_HSTXDDL1               ((uint32_t)0x00000008)

#define DSI_WPCR1_LPSRCCL                ((uint32_t)0x000000C0)              /*!< Low-Power transmission Slew Rate Compensation on Clock Lane */
#define DSI_WPCR1_LPSRCCL0               ((uint32_t)0x00000040)
#define DSI_WPCR1_LPSRCCL1               ((uint32_t)0x00000080)

#define DSI_WPCR1_LPSRCDL                ((uint32_t)0x00000300)              /*!< Low-Power transmission Slew Rate Compensation on Data Lane */
#define DSI_WPCR1_LPSRCDL0               ((uint32_t)0x00000100)
#define DSI_WPCR1_LPSRCDL1               ((uint32_t)0x00000200)

#define DSI_WPCR1_SDDC                   ((uint32_t)0x00001000)              /*!< SDD Control */

#define DSI_WPCR1_LPRXVCDL               ((uint32_t)0x0000C000)              /*!< Low-Power Reception V-IL Compensation on Data Lanes */
#define DSI_WPCR1_LPRXVCDL0              ((uint32_t)0x00004000)
#define DSI_WPCR1_LPRXVCDL1              ((uint32_t)0x00008000)

#define DSI_WPCR1_HSTXSRCCL              ((uint32_t)0x00030000)              /*!< High-Speed Transmission Delay on Clock Lane */
#define DSI_WPCR1_HSTXSRCCL0             ((uint32_t)0x00010000)
#define DSI_WPCR1_HSTXSRCCL1             ((uint32_t)0x00020000)

#define DSI_WPCR1_HSTXSRCDL              ((uint32_t)0x000C0000)              /*!< High-Speed Transmission Delay on Data Lane */
#define DSI_WPCR1_HSTXSRCDL0             ((uint32_t)0x00040000)
#define DSI_WPCR1_HSTXSRCDL1             ((uint32_t)0x00080000)

#define DSI_WPCR1_FLPRXLPM               ((uint32_t)0x00400000)              /*!< Forces LP Receiver in Low-Power Mode */

#define DSI_WPCR1_LPRXFT                 ((uint32_t)0x06000000)              /*!< Low-Power RX low-pass Filtering Tuning */
#define DSI_WPCR1_LPRXFT0                ((uint32_t)0x02000000)
#define DSI_WPCR1_LPRXFT1                ((uint32_t)0x04000000)

/*******************  Bit definition for DSI_WPCR2 register  ***************/
#define DSI_WPCR2_TCLKPREP               ((uint32_t)0x000000FF)              /*!< t-CLKPREP */
#define DSI_WPCR2_TCLKPREP0              ((uint32_t)0x00000001)
#define DSI_WPCR2_TCLKPREP1              ((uint32_t)0x00000002)
#define DSI_WPCR2_TCLKPREP2              ((uint32_t)0x00000004)
#define DSI_WPCR2_TCLKPREP3              ((uint32_t)0x00000008)
#define DSI_WPCR2_TCLKPREP4              ((uint32_t)0x00000010)
#define DSI_WPCR2_TCLKPREP5              ((uint32_t)0x00000020)
#define DSI_WPCR2_TCLKPREP6              ((uint32_t)0x00000040)
#define DSI_WPCR2_TCLKPREP7              ((uint32_t)0x00000080)

#define DSI_WPCR2_TCLKZERO               ((uint32_t)0x0000FF00)              /*!< t-CLKZERO */
#define DSI_WPCR2_TCLKZERO0              ((uint32_t)0x00000100)
#define DSI_WPCR2_TCLKZERO1              ((uint32_t)0x00000200)
#define DSI_WPCR2_TCLKZERO2              ((uint32_t)0x00000400)
#define DSI_WPCR2_TCLKZERO3              ((uint32_t)0x00000800)
#define DSI_WPCR2_TCLKZERO4              ((uint32_t)0x00001000)
#define DSI_WPCR2_TCLKZERO5              ((uint32_t)0x00002000)
#define DSI_WPCR2_TCLKZERO6              ((uint32_t)0x00004000)
#define DSI_WPCR2_TCLKZERO7              ((uint32_t)0x00008000)

